<details>
  <summary>Plan for **edsoncelio/digger-demo#staging**</summary>

  ```terraform
Terraform will perform the following actions:

  # aws_s3_bucket.bucket will be created
  + resource "aws_s3_bucket" "bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "digger-demo-staging-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CreatedBy"   = "terraform"
          + "Environment" = "staging"
          + "Name"        = "digger-demo-staging-bucket"
        }
      + tags_all                    = {
          + "CreatedBy"   = "terraform"
          + "Environment" = "staging"
          + "Name"        = "digger-demo-staging-bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_acl.example will be created
  + resource "aws_s3_bucket_acl" "example" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
  ```
</details>